export default function PrivacyPolicyPage() {
  return (
    <main className='container'>
      <h1 className='mt-3 text-center text-2xl font-bold'>سياسة الخصوصية</h1>

      <section className='px-4 py-6'>
        <p>
          خصوصيتك مهمة لدينا، لهذا اعددنا هذه الصفحة حتى نقوم بالكشف عن السياسات التي
          نتبعها في موقع سوق كرداسه من اجل معالجة معطيات زوار ومستخدمي الموقع.
        </p>

        <p className='mt-4'>
          إن سياسة موقع سوق كرداسه تحترم خصوصيتك فيما يتعلق بأي معلومات قد نجمعها
          أثناء تصفحك للموقع. وبناءً على ذلك، قد قمنا بإعداد صفحة سياسة الخصوصية هذه
          حتى يتسنى لك فهم الكيفية التي نجمع بها معلومات مستخدمي الموقع ونستخدمها
          ونكشف عنها إن لزم الأمر.
        </p>

        <h2 className='mt-6 text-xl font-semibold'>الخصوصية وبيان سرية المعلومات</h2>
        <p className='mt-2'>
          نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت.
        </p>

        <p className='mt-4'>
          لقد تم إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم
          بتجميعها منكم عند زيارتكم لموقعنا على شبكة الانترنت وكيفية تعاملنا مع هذه
          البيانات الشخصية.
        </p>

        <h3 className='mt-6 font-bold'>التصفح:</h3>
        <p className='mt-2'>
          لم نقم بتصميم هذا الموقع من أجل تجميع بياناتك الشخصية من الجهاز الخاص بك
          أياً كنت تستخدم أثناء تصفحك لهذا الموقع، وإنما سيتم فقط استخدام البيانات
          المقدمة من قبلك بمعرفتك ومحض إرادتك.
        </p>

        <h3 className='mt-6 font-bold'>عنوان بروتوكول شبكة الإنترنت (IP)</h3>
        <p className='mt-2'>
          في أي وقت تزور فيه اي موقع انترنت بما فيها هذا الموقع، سيقوم السيرفر المضيف
          بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك، تاريخ ووقت الزيارة ونوع
          متصفح الإنترنت الذي تستخدمه والعنوان URL الخاص بأي موقع من مواقع الإنترنت
          التي تقوم بإحالتك إلى هذا الموقع على الشبكة.
        </p>

        <h3 className='mt-6 font-bold'>عمليات المسح على الشبكة:</h3>
        <p className='mt-2'>
          إن عمليات المسح التي نقوم بها مباشرة على الشبكة تمكننا من تجميع بيانات
          محددة مثل البيانات المطلوبة منك بخصوص نظرتك وشعورك تجاه موقعنا. تعتبر ردودك
          ذات أهمية قصوى، ومحل تقديرنا حيث إنها تمكننا من تحسين مستوى موقعنا.
        </p>

        <h3 className='mt-6 font-bold'>الروابط بالمواقع الأخرى على شبكة الإنترنت</h3>
        <p className='mt-2'>
          قد يشتمل موقعنا على روابط بالمواقع الأخرى على شبكة الإنترنت، او اعلانات من
          مواقع اخرى مثل Google AdSense. نحن لا نعتبر مسئولين عن أساليب تجميع
          البيانات من قبل تلك المواقع.
        </p>

        <h3 className='mt-6 font-bold'>إفشاء المعلومات</h3>
        <p className='mt-2'>
          سنحافظ في كافة الأوقات على خصوصية وسرية كافة البيانات الشخصية التي نتحصل
          عليها. ولن يتم إفشاء هذه المعلومات إلا إذا كان ذلك مطلوباً بموجب أي قانون
          أو للدفاع عن أو حماية حقوق الملكية الخاصة بهذا الموقع.
        </p>

        <h3 className='mt-6 font-bold'>
          البيانات اللازمة لتنفيذ المعاملات المطلوبة
        </h3>
        <p className='mt-2'>
          عندما نحتاج إلى أية بيانات خاصة بك، فإننا سنطلب منك تقديمها بمحض إرادتك. لن
          يتم بيع البيانات المقدمة من قبلك إلى أي طرف ثالث بغرض تسويقها لمصلحته
          الخاصة.
        </p>

        <h3 className='mt-6 font-bold'>عند الاتصال بنا</h3>
        <p className='mt-2'>
          سيتم التعامل مع كافة البيانات المقدمة من قبلك على أساس أنها سرية. ستساعدنا
          هذه البيانات في تحسين موقعنا.
        </p>

        <h3 className='mt-6 font-bold'>إفشاء المعلومات لأي طرف ثالث</h3>
        <p className='mt-2'>
          لن نقوم ببيع، المتاجرة، تأجير، أو إفشاء أية معلومات لمصلحة أي طرف ثالث خارج
          هذا الموقع. وسيتم الكشف عن المعلومات فقط في حالة صدور أمر بذلك من قبل أي
          سلطة قضائية.
        </p>

        <h3 className='mt-6 font-bold'>
          التعديلات على سياسة سرية وخصوصية المعلومات
        </h3>
        <p className='mt-2'>
          نحتفظ بالحق في تعديل بنود وشروط سياسة سرية وخصوصية المعلومات إن لزم الأمر
          ومتى كان ذلك ملائماً.
        </p>

        <h3 className='mt-6 font-bold'>الاتصال بنا</h3>
        <p className='mt-2'>
          يمكنكم الاتصال بنا عند الحاجة من خلال الضغط على رابط تواصل معنا المتوفر في
          روابط موقعنا او الارسال الى بريدنا الالكتروني.
        </p>

        <h3 className='mt-6 font-bold'>اخيرا</h3>
        <p className='mt-2'>
          إن مخاوفك واهتمامك بشأن سرية وخصوصية البيانات تعتبر مسألة في غاية الأهمية
          بالنسبة لنا. نحن نأمل أن يتم تحقيق ذلك من خلال هذه السياسة.
        </p>
      </section>
    </main>
  )
}
