export default function TermsPage() {
  return (
    <main className='container'>
      <h1 className='mt-3 text-center text-2xl font-bold'>الشروط والأحكام</h1>

      <section className='px-4 py-6'>
        <h2 className='text-xl font-semibold'>الشحن والتسليم</h2>

        <h3 className='mt-4 text-lg font-semibold'>أوقات الاستلام</h3>
        <p className='mt-2'>
          أوقات التسليم تقديرية وغير مضمونة. سنبذل قصارى جهدنا لتوصيل الشحنات بأسرع
          وقت ممكن، مع العلم:
          <br />
          – قد تؤثر تأخيرات من شركات الشحن على أوقات التسليم.
          <br />
          – الطقس والظروف الأخرى قد تؤخر التسليم.
          <br />– الشحن إلى جنوب مصر قد يستغرق وقتاً أطول.
        </p>

        <h3 className='mt-4 font-bold'>
          أوقات التسليم المقدرة بعد مغادرة مستودعاتنا:
        </h3>
        <p className='mt-2'>من اليوم التالى إلى 4 ايام عمل</p>

        <h3 className='mt-6 font-bold'>أسعار الشحن</h3>
        <p className='mt-2'>
          تكلفة ثابتة للشحن داخل القاهرة والجيزة: 40<strong> جنيهاً</strong>
          <br />
          العرض لفترة محدودة وقد يتغير بدون إشعار.
        </p>

        <p className='mt-4'>
          تكلفة الشحن تعتمد على الوجهة، والجداول الزمنية للتسليم تقديرية وتخضع لتأخير
          من قبل شركات الشحن.
        </p>

        <p className='mt-4'>قائمة أسعار الشحن للمحافظات:</p>
        <ul className='mt-2'>
          <li>القاهرة والجيزة: 40 جنيهاً</li>
          <li>الأسكندرية: 50 جنيهاً</li>
          <li>محافظات الدلتا والقناة: 65 جنيهاً</li>
          <li>محافظات البحر الأحمر والجنوب: 70 جنيهاً</li>
        </ul>

        <h3 className='mt-6 font-bold'>الشحن السريع</h3>
        <p className='mt-2'>
          الشحن في اليوم التالي قد يكون متاحاً للعناصر المؤهلة.
          <br />– يرجى تفهم أي تأخير ناتج عن عدم التجاوب السريع.
        </p>

        <h2 className='mt-6 text-xl font-semibold'>سياسة الاستبدال والاسترجاع</h2>
        <p className='mt-2'>
          يتم استبدال أو استرجاع المنتجات خلال 14 يومًا من تاريخ الاستلام:
          <br />
          – استرجاع المنتجات في حالة وجود عيب صناعي ستتحمل الشركة مصاريف الشحن.
          <br />– في حال طلب الاسترجاع بدون عيب في المنتج: إذا كانت المنتجات بحالتها
          الأصلية، سيتم خصم تكاليف الشحن من المبلغ المسترد.
        </p>

        <p className='mt-4 font-bold'>إجراءات الاستبدال والاسترجاع:</p>
        <p className='mt-2'>
          يمكنك الاتصال بخدمة العملاء عبر الهاتف أو الواتساب لطلب استبدال أو استرجاع
          المنتج.
          <br />
          – يجب إرجاع المنتج في عبوته الأصلية مع كل الملحقات، وستتحمل تكاليف الشحن
          إذا لم يكن هناك عيب في المنتج.
          <br />– يتم استرداد الأموال خلال 10 أيام عمل بعد استلام المنتج وفحصه.
        </p>
      </section>
    </main>
  )
}
